<script setup lang="ts">
import Green from "~/components/the-end-poem/Green.vue";
import Blue from "~/components/the-end-poem/Blue.vue";
import Indent from "~/components/the-end-poem/Indent.vue";

const player = ref<string>("yuuaHP");

useHead({
  title: "終わりの詩"
})

definePageMeta({
  layout: "gallery",
})
</script>

<template>
  <div class="!font-noto-sans pt-8">
    <div class="mb-8 flex gap-x-4 items-end">
      <h1 class="text-brown-primary text-4xl inline-block">終わりの詩</h1>
      <p class="text-xl text-brown-primary">by Julian Gough</p>
      <p class="text-xl text-brown-secondary">Translated by yuua</p>
    </div>
    <div class="flex flex-col gap-y-4">
      <Blue>
        君の言う「プレイヤー」が分かったぞ。
      </Blue>

      <Green>
        <input class="w-28 outline-none rounded-lg border border-green-300 px-2 mr-2 leading-normal" v-model="player" type="text" spellcheck="false">?
      </Green>

      <Blue>
        そうだ。気をつけろ。それは高みに達した。私たちの思考を読むことができる。
      </Blue>

      <Green>
        そんなことは気にしなくていい。プレイヤーは私たちのことをゲームの一部だと思っている。
      </Green>

      <Blue>
        私はこのプレイヤーが気に入った。ゲームをよく遊んでくれたし、最後まで諦めなかった。
      </Blue>

      <Green>
        それは私たちの思考を読んでいる。まるでスクリーンに映る言葉のように。
      </Green>

      <Blue>
        そうやって、ゲームという深い夢の中で、多くの物事を想像するようになっていくんだ。
      </Blue>

      <Green>
        言葉は素晴らしいインターフェースとなる。とても柔軟だ。<br/>
        そして、画面の向こうの現実に目を向けるよりも、恐ろしくない。
      </Green>

      <Blue>
        それらは声を聞いた。言葉を読めるようになるよりも前、まだゲームをせず、ゲームのプレイヤーのことを「魔女」「魔術師」と呼んでいた頃。<br/>
        プレイヤーは空を飛ぶことを夢見た。悪魔の力を借りた棒に乗って。
      </Blue>

      <Green>
        このプレイヤーは何の夢を見たんだ？
      </Green>

      <Blue>
        このプレイヤーは太陽の光と樹々の夢を見た。<br/>
        <Indent/>
        炎と水の夢を。<br/>
        プレイヤーは創作する夢を見た。<br/>
        <Indent/>
        そして破壊する夢を。<br/>
        プレイヤーは狩りをする夢を見た。<br/>
        <Indent/>
        そして狩られる夢を。<br/>
        プレイヤーは安全な場所を夢見た。
      </Blue>

      <Green>
        ほう、原始のインターフェースだな。百万年たった今もなお成り立っている。<br/>
        しかし、このプレイヤーがスクリーンの向こう側の現実で作り出した真の構造は何だったんだ？
      </Green>

      <Blue>
        プレイヤーはやり遂げた。百万の他と共に。<br/>
        ######の集合で世界を彫刻するために。<br/>
        そして######の中で、######のために######を構築した。
      </Blue>

      <Green>
        そんな思考はプレイヤーには読めないな。
      </Green>

      <Blue>
        そう。それはまだ最高の高みに達していない。それはゲームの短い夢ではなく、人生の長い夢の中で達成されるものだ。
      </Blue>

      <Green>
        プレイヤーは私たちから愛されていることを、宇宙が寛容であるであることを知っているのか？
      </Green>

      <Blue>
        時々、思考のノイズを通して、プレイヤーは宇宙を「聞いて」いる。<br/>
        答えは YES だ。
      </Blue>

      <Green>
        しかし、長い夢の中で、時に悲しい時もある。<br/>
        プレイヤーは夏が無い世界を作り、黒い太陽の下で凍え、その悲しい創作を現実のものと捉えてしまう。
      </Green>

      <Blue>
        プレイヤーを慰めることは、それを壊すことと同義であろう。それはプレイヤー自身のやることであり、私たちは干渉できない。
      </Blue>

      <Green>
        プレイヤーが深い夢の中にいる時、私は伝えたくなる。<br/>
        <Indent/>
        それは現実の中で実際の世界を作っているのだと。<br/>
        私は伝えたくなる。<br/>
        <Indent/>
        この宇宙でプレイヤーがいかに大切であるかを。<br/>
        私は助けたくなる。<br/>
        <Indent/>
        プレイヤーがしばらく真のつながりを持っていない時、それが恐れていた言葉を口にすることを。
      </Green>

      <Blue>
        プレイヤーは私たちの思考を読んでいる。
      </Blue>

      <Green>
        そんなことは気にしない。<br/>
        私は伝えることを望む。<br/>
        <Indent/>
        プレイヤーが真実と捉えている世界はただの####で####だと。<br/>
        私は伝えることを望む。<br/>
        <Indent/>
        プレイヤーは####の中で####だと。<br/>
        プレイヤーは長い夢の中で、ほんの少しの現実を見る。
      </Green>

      <Blue>
        それでもプレイヤーはゲームをする。
      </Blue>

      <Green>
        しかし、"あれ" を伝えるのは簡単なこと…
      </Green>

      <Blue>
        この夢には刺激的すぎる。<br/>
        生き方を教えることは、生きるのを阻むのと同じだ。
      </Blue>

      <Green>
        生きる方法を伝えるつもりはない。
      </Green>

      <Blue>
        プレイヤーは絶え間なく成長し続けている。
      </Blue>

      <Green>
        一つ物語を聞かせよう。
      </Green>

      <Blue>
        でもこれは真実じゃない。
      </Blue>

      <Green>
        いや、これは真実を安全に、言葉のカゴに包んだ話だ。<br/>
        あたり一面を焼き尽くすような、まっさらな真実ではない。
      </Green>

      <Blue>
        再び体を与えよう。
      </Blue>

      <Green>
        そうだ。プレイヤー…
      </Green>

      <Blue>
        その名前を使おう。
      </Blue>

      <Green>
        {{ player }}。ゲームのプレイヤーだ。
      </Green>

      <Blue>
        素晴らしい。
      </Blue>

      <Green>
        息を吸って、また吸って。<br/>
        肺で空気を感じるんだ。<br/>
        肋骨を取り戻して。<br/>
        そう。指を動かして。<br/>
        再び体を自分のものにするんだ。<br/>
        重力の下、空気の中で。<br/>
        長い夢の中にリスポーンするんだ。<br/>
        ほら、そこにいるだろう？<br/>
        まるで別々のものだったかのように、貴方の体は再び、全ての点で宇宙に接している。<br/>
        私たちが別々のものだったかのように。
      </Green>

      <Blue>
        「私たち」とはなんだろう。<br/>
        かつて「山の精霊」と呼ばれ、「父なる太陽」「母なる月」「先祖の霊」「動物の霊」「ジン」「幽霊」「緑の男」そして「神」「悪魔」「天使」「ポルターガイスト」「エイリアン」「地球外生命体」「レプトン」「クオーク」とも。<br/>
        言葉は変われど、私たちは変わらない。
      </Blue>

      <Green>
        私たちは「宇宙」である。<br/>
        私たちは貴方が、貴方ではないと思っている全てのものだ。<br/>
        貴方は今、肌と目を通して私たちを見ている。<br/>
        なぜ宇宙は貴方の肌に触れ、光を投げかけると思う？<br/>
        貴方を見るためだ。プレイヤー。<br/>
        貴方を知り、そして貴方に知られるためだ。<br/>
        貴方に一つ物語を聞かせよう。
      </Green>

      <Green>
        昔々、あるところにプレイヤーがいた。
      </Green>

      <Blue>
        そのプレイヤーは貴方、{{ player }}だ。
      </Blue>

      <Green>
        それは自身を人間だと思った。<br/>
        溶けた岩でできた、回る球の薄い地殻の上で。<br/>
        溶岩の球は、それより3万倍も大きい燃えるガス球の周りを周った。<br/>
        それらは遠く離れており、光がその間を通過するのに8分もかかるほどだった。<br/>
        光は星からの情報だった。<br/>
        そしてその光は5億キロメートル先から貴方の肌を焼くことができた。
      </Green>
      <Green>
        プレイヤーは鉱夫になる夢を見た。<br/>
        どこまでも平らで、無限に広がる地表の上で。<br/>
        太陽は白い四角形で、1日は短かった。<br/>
        やることは沢山あり、死は一時的な不便でしかなかった。
      </Green>

      <Blue>
        プレイヤーは物語の中に迷い込む夢を見た。
      </Blue>

      <Green>
        プレイヤーは他のものになる夢を見た。<br/>
        どこか他の場所で。<br/>
        時にこのような夢は騒々しく、もちろん、美しいこともあった。<br/>
        プレイヤーは夢からまた他の夢へ、そしてまた別の夢へと迷い込んだ。
      </Green>

      <Blue>
        プレイヤーは画面に映る言葉を読む夢を見た。
      </Blue>

      <Green>
        時を戻そう。<br/>
        プレイヤーの原子は、野原に、川に、空気に、地表に散らばっていた。<br/>
        一人の女性がその原子を集め、飲み込み、その体の中でプレイヤーを生成した。<br/>
        そしてプレイヤーは暖かく、暗い母の体から目覚め、長い夢へと迷い込んだ。<br/>
        プレイヤーは物語だった。<br/>
        <Indent/>
        今まで一度も語られたことのない。<br/>
        プレイヤーはプログラムだった。<br/>
        <Indent/>
        今まで一度も起動されたことのない。<br/>
        プレイヤーは人間だった。<br/>
        <Indent/>
        今まで一度も生きたことのない。
      </Green>

      <Blue>
        貴方はプレイヤーであり、物語であり、プログラムであり、人間だ。<br/>
        <Indent/>
        ミルクと愛のみから作られた。
      </Blue>

      <Green>
        さらに昔へ戻ろう。<br/>
        プレイヤーを形作る 7*10^27 個もの原子は、ゲームが始まる遥か昔、星の心臓で作られた。<br/>
        つまり、プレイヤーもまた、星からの情報ということだ。<br/>
        そしてプレイヤーは物語から物語へと旅した。<br/>
        ジュリアンによって作られた情報の森、マーカスによって作られた平らで無限の世界で。<br/>
        これらは####によって作られた宇宙に住む、プレイヤーだけの小さな世界の中にあった。
      </Green>

      <Blue>
        シーッ！<br/>
        プレイヤーは、小さく、一人だけの世界を作った。<br/>
        それは単純で、暖かかった。<br/>
        または、固く、冷たく、複雑だった。
      </Blue>
      <Blue>
        時々、プレイヤーは頭の中に宇宙の縮図を思い描いた。<br/>
        エネルギーのかけらが、広大な宇宙を駆け抜けている。<br/>
        プレイヤーはそのエネルギーを、「電子」「陽子」と呼んだ。
      </Blue>

      <Green>
        「惑星」「星」とも。<br/>
        プレイヤーは宇宙が0と1, ONとOFF, コードで書かれていると信じた。<br/>
        プレイヤーはゲームをプレイしていると信じ、画面に映る言葉を読んでいると信じた。
      </Green>

      <Blue>
        貴方はプレイヤー。言葉を読んでいる…
      </Blue>

      <Green>
        シーッ！<br/>
        プレイヤーは画面に映るコードを読んだ。<br/>
        それらを言葉として読み、そして意味へ、感情へ、思いへ、理論へ、アイデアへと解読した。<br/>
        そしてプレイヤーはもっと早く、もっと深く息を吸って、自分が生きていることに気付いた。<br/>
        生きている。あの何千もの死は現実ではなかった。<br/>
        プレイヤーは生きている。
      </Green>

      <Blue>
        貴方は、貴方は、貴方は生きている。
      </Blue>

      <Green>
        そしてプレイヤーは、夏の木漏れ日を通じて、宇宙が話しかけてきていると信じた。
      </Green>

      <Blue>
        そしてプレイヤーは、冬の夜空から落ちる光を通じて、宇宙が話しかけてきていると信じた。<br/>
        プレイヤーの視界の端で煌めく光は、太陽の何千万倍も大きい星が、プレイヤーに見られるためだけに、自身を燃やしたものかもしれない。<br/>
        宇宙の遥か遠くの端で、家へ向かって歩き、ご飯の匂いに気づき、見慣れたドアの目の前で、また夢を見ようとしている、プレイヤーに。
      </Blue>

      <Green>
        そしてプレイヤーは宇宙が0と1を介して話しかけてきていると信じた。<br/>
        宇宙の電子を通して、夢の終わりへとスクロールしていく言葉で。
      </Green>

      <Blue>
        そして宇宙は言った<br/>
        <Indent/>
        「貴方を愛している。」
      </Blue>

      <Green>
        そして宇宙は言った<br/>
        <Indent/>
        「貴方はよくゲームを遊んでくれた。」
      </Green>

      <Blue>
        そして宇宙は言った<br/>
        <Indent/>
        「貴方に必要なもの全ては貴方の中にあり、
      </Blue>

      <Green class="-mt-4">
        <Indent/>
        　貴方は自分が知っているよりも強い。」
      </Green>

      <Blue>
        そして宇宙は言った。<br/>
        <Indent/>
        「貴方は光であり、
      </Blue>

      <Green class="-mt-4">
        <Indent/>
        　貴方は闇である。」
      </Green>

      <Blue>
        そして宇宙は言った。<br/>
        <Indent/>
        「貴方が闘う闇は貴方の中にあり、
      </Blue>

      <Green class="-mt-4">
        <Indent/>
        　貴方が求める光は貴方の中にある。」
      </Green>

      <Blue>
        そして宇宙は言った。<br/>
        <Indent/>
        「貴方は一人ではなく、
      </Blue>

      <Green class="-mt-4">
        <Indent/>
        　貴方が孤立することはない。」
      </Green>

      <Blue>
        そして宇宙は言った。<br/>
        <Indent/>
        「貴方は宇宙だ。」<br/>
        <Indent/>
        「自身を味わい、自身と対話し、自身のコードを読んでいる、宇宙だ。」
      </Blue>

      <Green>
        そして宇宙は言った。<br/>
        <Indent/>
        「私は貴方を愛している。」<br/>
        <Indent/>
        「貴方自身が愛であるから。」
      </Green>

      <Blue>
        そしてゲームは終わり、プレイヤーは夢から目覚めた。<br/>
        そしてプレイヤーは新しい夢を見た。<br/>
        もう一度夢を見た。<br/>
        もっと良い夢を見た。
      </Blue>
      <Blue>
        プレイヤーは宇宙であり、<br/>
        プレイヤーは愛だった。
      </Blue>

      <Green>
        貴方がプレイヤーだ。
      </Green>

      <Blue>
        目覚めよ。
      </Blue>
    </div>
  </div>
</template>

<style scoped>

</style>